perf/timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    node_replicated:
      target: 'http://localhost:5555/node_replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Cleanup
      duration: 30
      arrivalRate: 0
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 30
    - name: Cleanup
      duration: 30
      arrivalRate: 0
    

scenarios:
  - name: Timeout (/timeout)
    flow:
      - get:
          url: '/timeout'